12/data/attachments/f6b8eef5e85a91a4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d1312f10-2f27-468c-a685-2afde87b5468</nif:username>
            <nif:friendToBeAdded>Misty_value_Friend_40218_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>